set_property PACKAGE_PIN AA10 [get_ports {cmos1_sda}]
set_property PACKAGE_PIN AE15 [get_ports {cmos1_db[9]}]
set_property PACKAGE_PIN AE16 [get_ports {cmos1_db[8]}]
set_property PACKAGE_PIN W15	 [get_ports {cmos1_scl}]
set_property PACKAGE_PIN W16  [get_ports {cmos1_db[5]}]
set_property PACKAGE_PIN AC16 [get_ports {cmos1_db[3]}]
set_property PACKAGE_PIN AC17 [get_ports {cmos1_db[4]}]
set_property PACKAGE_PIN AD10 [get_ports {cmos1_db[6]}]
set_property PACKAGE_PIN AE10 [get_ports {cmos1_db[0]}]
set_property PACKAGE_PIN AE12 [get_ports {cmos1_db[7]}]
set_property PACKAGE_PIN AF12 [get_ports {cmos1_db[1]}]
set_property PACKAGE_PIN AB10 [get_ports {cmos1_db[2]}]
set_property PACKAGE_PIN AB11 [get_ports {cmos1_pclk}]
set_property PACKAGE_PIN AB16 [get_ports {cmos1_href}]
set_property PACKAGE_PIN AB17 [get_ports {cmos1_vsync}]
set_property PACKAGE_PIN AA17 [get_ports {cmos1_rst_n}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_sda}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_scl}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_db[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_pclk}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_href}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_vsync}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos1_rst_n}]

create_clock -period 11.904 [get_ports cmos1_pclk]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets cmos1_pclk_IBUF]
set_input_delay -clock [get_clocks cmos1_pclk] 2.200 [get_ports {cmos1_db[*]}]
set_input_delay -clock [get_clocks cmos1_pclk] 2.200 [get_ports cmos1_href]
set_input_delay -clock [get_clocks cmos1_pclk] -min -add_delay 2.200 [get_ports cmos1_vsync]
set_input_delay -clock [get_clocks cmos1_pclk] -max -add_delay 4.000 [get_ports cmos1_vsync]

set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_vsync}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_pclk}]

set_property PACKAGE_PIN Y11	 [get_ports {cmos2_db[9]}]
set_property PACKAGE_PIN Y12	 [get_ports {cmos2_sda}]
set_property PACKAGE_PIN AC11 [get_ports {cmos2_db[6]}]
set_property PACKAGE_PIN AB12 [get_ports {cmos2_scl}]
set_property PACKAGE_PIN AA12 [get_ports {cmos2_db[7]}]
set_property PACKAGE_PIN AA13 [get_ports {cmos2_db[2]}]
set_property PACKAGE_PIN AF10 [get_ports {cmos2_href}]
set_property PACKAGE_PIN AE11 [get_ports {cmos2_db[8]}]
set_property PACKAGE_PIN AC13 [get_ports {cmos2_db[3]}]
set_property PACKAGE_PIN AD13 [get_ports {cmos2_rst_n}]
set_property PACKAGE_PIN Y13	 [get_ports {cmos2_db[4]}]
set_property PACKAGE_PIN W13	 [get_ports {cmos2_db[5]}]
set_property PACKAGE_PIN AD11 [get_ports {cmos2_db[1]}]
set_property PACKAGE_PIN AC12 [get_ports {cmos2_db[0]}]
set_property PACKAGE_PIN AA14 [get_ports {cmos2_vsync}]
set_property PACKAGE_PIN AA15 [get_ports {cmos2_pclk}]

set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_sda}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_scl}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_href}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_rst_n}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {cmos2_db[0]}]

set_property PULLUP true [get_ports cmos1_scl]
set_property PULLUP true [get_ports cmos1_sda]
set_property PULLUP true [get_ports cmos2_scl]
set_property PULLUP true [get_ports cmos2_sda]


create_clock -period 11.904 [get_ports cmos2_pclk]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets cmos2_pclk_IBUF]
set_input_delay -clock [get_clocks cmos2_pclk] -min -add_delay 2.200 [get_ports {cmos2_db[*]}]
set_input_delay -clock [get_clocks cmos2_pclk] -max -add_delay 4.000 [get_ports {cmos2_db[*]}]
set_input_delay -clock [get_clocks cmos2_pclk] -min -add_delay 2.200 [get_ports cmos2_href]
set_input_delay -clock [get_clocks cmos2_pclk] -max -add_delay 4.000 [get_ports cmos2_href]
set_input_delay -clock [get_clocks cmos2_pclk] -min -add_delay 2.200 [get_ports cmos2_vsync]
set_input_delay -clock [get_clocks cmos2_pclk] -max -add_delay 4.000 [get_ports cmos2_vsync]
set_false_path -from [get_clocks clk_pll_i] -to [get_clocks clk_out1_video_pll]
set_false_path -from [get_clocks clk_out1_video_pll] -to [get_clocks clk_pll_i]